#######################################
# Taps
#######################################

tap "domt4/autoupdate"
tap "qmk/qmk"
tap "yqrashawn/goku"

#######################################
# Formulae
#######################################

brew "bitwarden-cli"
# Tool for connecting to bluetooth devices (installed for Alfred workflow for AirPods connections)
brew "bluetoothconnector"
# More Docker / container runtimes
brew "colima"
brew "dockutil"
# Tool for managing default apps for each extension on macos
brew "duti"
brew "fzf"
brew "go"
brew "hyperfine"
brew "neovim"
# This does come with nvm, but doing it this way lets us leverage brew autoupdating
brew "npm"
brew "python"
# No longer seems to come on macOS by default (since Monterrey), and is unfortunately necessary for the Alfred Trello workflow I use
brew "php"
brew "qmk/qmk/qmk"
brew "ruby"
# Formatter for shell scripts
brew "shfmt"
brew "yarn"
brew "yqrashawn/goku/goku"
brew "zsh-syntax-highlighting"

####################
# Utils /
#   GNU replacements
####################

brew "bat"
brew "coreutils"
# Better `ls` util
brew "exa"
# Better "find" util
brew "fd"
brew "findutils"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-indent"
brew "gnu-which"
brew "grep"
brew "gnutls"
brew "gawk"
brew "gzip"
brew "make"
brew "pngpaste"

#######################################
# Casks
#######################################

cask "alfred"
cask "bartender"
cask "bitwarden"
cask "cold-turkey-blocker"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "monitorcontrol"
cask "rectangle"
cask "spotify"
cask "slack"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
