#######################################
# Taps
#######################################

tap "domt4/autoupdate"

#######################################
# Formulae
#######################################

brew "bat"
brew "bitwarden-cli"
# Tool for connecting to bluetooth devices (installed for Alfred workflow for AirPods connections)
brew "bluetoothconnector"
brew "dockutil"
# Tool for managing default apps for each extension on macos
brew "duti"
# Better `ls` util
brew "exa"
# Better "find" util
brew "fd"
brew "fzf"
brew "git"
brew "go"
brew "gnu-sed"
# Tool for making Karabiner config management more manageable and powerful
brew "nvm"
# This does come with nvm, but doing it this way lets us leverage brew autoupdating
brew "npm"
brew "python"
brew "yarn"
brew "yqrashawn/goku/goku"

#######################################
# Casks
#######################################

cask "alfred"
cask "bartender"
cask "bitwarden"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "postman"
cask "rectangle"
cask "spotify"
cask "slack"
cask "visual-studio-code"
cask "zoom"
