#######################################
# Taps
#######################################

tap "domt4/autoupdate"

#######################################
# Formulae
#######################################

brew "bitwarden-cli"
# Tool for connecting to bluetooth devices (installed for Alfred workflow for AirPods connections)
brew "bluetoothconnector"
# Tool for managing default apps for each extension on macos
brew "duti"
# Better "find" util
brew "fd"
brew "fzf"
brew "git"
# Tool for making Karabiner config management more manageable and powerful
brew "goku"
brew "nvm"
brew "python"
brew "yarn"
# Q: Are these necessary, or do they come with nvm?
# node
# npm

#######################################
# Casks
#######################################

cask "alfred"
cask "bartender"
cask "docker"
cask "firefox"
cask "flux"
# NEXT_MACHINE
# cask "google-chrome"
cask "karabiner-elements"
cask "postman"
cask "rectangle"
cask "spotify"
# NEXT_MACHINE
# cask "slack"
# cask "visual-studio-code"
# cask "zoomus"